1. install pymysql

done

2. add env to .gitignore

done

3. Create a function named get_db_url. It should accept a 
username, hostname, password, and database name and return 
a url connection string formatted like in the example at the start of this lesson.

In [1]:
from env import host, user, password

In [2]:
import pandas as pd
import numpy as np

In [3]:
def get_db_url(db_name, host=host, user=user, password=password):
    url = f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
    return url

4. Use your function to obtain a connection to the employees database.

In [48]:
connection = get_db_url('employees')

5. Once you have successfully run a query:

In [18]:
pd.read_sql('''
SELECT *
FROM employees
LIMIT 5;
''', connection)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

a. Intentionally make a typo in the database url. What kind of error message do you see?

In [ ]:
bad_connection = get_db_url('employ')

pd.read_sql('''
SELECT *
FROM employees
LIMIT 5;
''', bad_connection)

# What kind of error message do you see?
OperationalError: (pymysql.err.OperationalError) (
    1044, "Access denied for user xxxx@'%' to database 'employ'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
pd.read_sql('''
SELECT *
FROM employ
LIMIT 5;
''', connection)

# What does the error message look like?
ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employ' doesn't exist")
[SQL: 
SELECT *
FROM employ
LIMIT 5;
]
(Background on this error at: https://sqlalche.me/e/14/f405)

6. Read the employees and titles tables into two separate DataFrames.

In [49]:
employees_query = '''
SELECT *
FROM employees;
'''

employees_df = pd.read_sql(employees_query, connection)
employees_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [50]:
titles_query = '''
SELECT *
FROM titles;
'''

titles_df = pd.read_sql(titles_query, connection)
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [27]:
employees_df.shape
# 300,024 rows, 6 columns
# expected 300,024 rows, 6 columns

(300024, 6)

In [28]:
titles_df.shape
# 443,308 rows, 4 columns
# expected 443,308 rows, 4 columns

(443308, 4)

8. Display the summary statistics for each DataFrame.

In [31]:
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [66]:
employees_df[['birth_date', 'first_name', 'last_name', 'gender', 'hire_date']].describe()

        birth_date first_name last_name  gender   hire_date
count       300024     300024    300024  300024      300024
unique        4750       1275      1637       2        5434
top     1952-03-08     Shahab      Baba       M  1985-06-20
freq            95        295       226  179973         132

In [32]:
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [67]:
titles_df[['title', 'from_date', 'to_date']].describe()

           title   from_date     to_date
count     443308      443308      443308
unique         7        6393        5888
top     Engineer  1998-10-25  9999-01-01
freq      115003         132      240124

9. How many unique titles are in the titles DataFrame?

In [36]:
len(titles_df.title.unique())

7

In [56]:
titles_df.title.nunique()

7

10. What is the oldest date in the to_date column?

In [37]:
min(titles_df.to_date)

datetime.date(1985, 3, 1)

11. What is the most recent date in the to_date column?

In [45]:
import datetime

In [53]:
max(titles_df.to_date[titles_df.to_date < datetime.date.today()])

datetime.date(2002, 8, 1)

In [57]:
max(titles_df.to_date[titles_df.to_date < max(titles_df.to_date)])

datetime.date(2002, 8, 1)

# Exercises part 2

1. Copy the users and roles DataFrames from the examples above.

In [68]:
# Create the users DataFrame.
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [69]:
# Create the roles DataFrame
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2. What is the result of using a right join on the DataFrames?

In [124]:
pd.merge(users, roles, how='right', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

3. What is the result of using an outer join on the DataFrames?

In [72]:
pd.merge(users, roles, how='outer', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [73]:
users_temp = users.drop(columns='role_id')

In [74]:
pd.merge(users_temp, roles, how='outer', on='id')

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter
4   5   jane        NaN
5   6   mike        NaN

we can still merge using 'id', but the info is incorrect since it's just listing the info from each table as if it was concatonated together.

5. Load the mpg dataset from PyDataset.

In [77]:
from pydataset import data

In [80]:
mpg = data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

6. Output and read the documentation for the mpg dataset.

In [82]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

7. How many rows and columns are in the dataset?

In [83]:
mpg.shape
#234 rows, 11 columns

(234, 11)

8. Check out your column names and perform any cleanup you may want on them.

In [84]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [125]:
mpg = mpg.rename(columns= {'cty':'city', 'fl':'fuel', 'class':'cls'})
#class is a reserved word, so we want to change that column name to something else
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'city',
       'hwy', 'fuel', 'cls', 'mileage_difference', 'average_mileage',
       'is_automatic'],
      dtype='object')

9. Display the summary statistics for the dataset.

In [93]:
mpg.describe().round(1)

       displ    year    cyl   city    hwy
count  234.0   234.0  234.0  234.0  234.0
mean     3.5  2003.5    5.9   16.9   23.4
std      1.3     4.5    1.6    4.3    6.0
min      1.6  1999.0    4.0    9.0   12.0
25%      2.4  1999.0    4.0   14.0   18.0
50%      3.3  2003.5    6.0   17.0   24.0
75%      4.6  2008.0    8.0   19.0   27.0
max      7.0  2008.0    8.0   35.0   44.0

10. How many different manufacturers are there?

In [94]:
mpg.manufacturer.nunique()

15

11. How many different models are there?

In [95]:
mpg.model.nunique()

38

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [97]:
mpg['mileage_difference'] = mpg.hwy - mpg.city
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [99]:
mpg['average_mileage'] = (mpg.hwy + mpg.city) / 2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [127]:
mpg[['city','hwy']].agg('mean', axis=1)

1      23.5
2      25.0
3      25.5
4      25.5
5      21.0
       ...
230    23.5
231    25.0
232    21.0
233    22.0
234    21.5
Length: 234, dtype: float64

In [128]:
mpg[['city','hwy']].mean(axis=1)

1      23.5
2      25.0
3      25.5
4      25.5
5      21.0
       ...
230    23.5
231    25.0
232    21.0
233    22.0
234    21.5
Length: 234, dtype: float64

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [103]:
mpg['is_automatic'] = mpg.trans.str.contains('auto')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

In [129]:
mpg.trans.str.startswith('auto')

1       True
2      False
3      False
4       True
5       True
       ...
230     True
231    False
232     True
233    False
234     True
Name: trans, Length: 234, dtype: bool

In [130]:
mpg.trans.apply(lambda x: 'auto' in x)

1       True
2      False
3      False
4       True
5       True
       ...
230     True
231    False
232     True
233    False
234     True
Name: trans, Length: 234, dtype: bool

15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [117]:
mpg.groupby(['manufacturer'])[['average_mileage']].agg('mean').sort_values(
    'average_mileage', ascending=False).head(1)
#honda

              average_mileage
manufacturer
honda                    28.5

In [133]:
mpg.groupby('manufacturer').average_mileage.mean().nlargest(1, keep='all')

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

16. Do automatic or manual cars have better miles per gallon?

In [111]:
mpg.groupby(['is_automatic'])[['average_mileage']].agg('mean').round(1) 
#manuals have better mpg on average

              average_mileage
is_automatic
False                    22.2
True                     19.1

In [136]:
mpg.groupby('is_automatic').average_mileage.mean().round(1)

is_automatic
False    22.2
True     19.1
Name: average_mileage, dtype: float64

# Exercise 3

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [98]:
connection = get_db_url('chipotle')

In [99]:
query = 'SELECT * FROM orders'

df = pd.read_sql(query, connection)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   object
dtypes: int64(3), object(3)
memory usage: 216.8+ KB

In [100]:
df.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [8]:
df.shape

(4622, 6)

2. What is the total price for each order?

In [103]:
df['item_total'] = df.item_price.str.replace(
    '$','', regex=False).astype(float)

In [104]:
df.head()

,id,order_id,quantity,item_name,choice_description,item_price,item_total
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,2.39
1,2,1,1,Izze,[Clementine],$3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98

In [36]:
df['order_id'].nunique()

1834

In [105]:
#What is the total price for each order?
df[['order_id','item_total']].groupby('order_id').sum()

          item_total
order_id
1              11.56
2              16.98
3              12.67
4              21.00
5              13.70
...              ...
1830           23.00
1831           12.90
1832           13.20
1833           23.50
1834           28.75

[1834 rows x 1 columns]

In [115]:
df.groupby('order_id').item_total.sum()

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_total, Length: 1834, dtype: float64

3. What are the most popular 3 items?

In [108]:
df.groupby('item_name').quantity.sum().nlargest(3,'all')

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

4. Which item has produced the most revenue?

In [114]:
df.groupby('item_name').item_total.sum().nlargest(1)

item_name
Chicken Bowl    7342.73
Name: item_total, dtype: float64

5. Join the employees and titles DataFrames together.

In [51]:
employees_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [52]:
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [57]:
emp_df = pd.merge(employees_df, titles_df, how='inner', on='emp_no')
emp_df

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [61]:
emp_df.groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [116]:
emp_df.pivot_table(index='title', values='hire_date', aggfunc='max')

                     hire_date
title
Assistant Engineer  1999-12-24
Engineer            2000-01-28
Manager             1992-02-05
Senior Engineer     2000-01-01
Senior Staff        2000-01-13
Staff               2000-01-12
Technique Leader    1999-12-31

In [64]:
# 7. Write the code necessary to 
# create a cross tabulation of the number of titles by department. 
# (Hint: this will involve a combination of SQL code to pull the 
# necessary data and python/pandas code to perform the manipulations.)
connection = get_db_url('employees')
query = '''
SELECT emp_no, title, dept_name 
FROM titles
	JOIN dept_emp
		USING (emp_no)
	JOIN departments
		USING (dept_no)
;'''

df = pd.read_sql(query, connection)

In [65]:
df.head()

   emp_no         title         dept_name
0   10011         Staff  Customer Service
1   10038  Senior Staff  Customer Service
2   10038         Staff  Customer Service
3   10049  Senior Staff  Customer Service
4   10049         Staff  Customer Service

In [83]:
df.shape

(489903, 3)

In [68]:
pd.crosstab(df.dept_name, df.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0

In [69]:
pd.crosstab(df.dept_name, df.title, margins=True)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader,All
dept_name,,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309,35075
Development,7769,58135,2,49326,1247,1424,7683,125586
Finance,0,0,2,0,12139,13929,0,26070
Human Resources,0,0,2,0,12274,14342,0,26618
Marketing,0,0,2,0,13940,16196,0,30138
Production,6445,49649,4,42205,1270,1478,6557,107608
Quality Management,1831,13852,4,11864,0,0,1795,29346
Research,378,2986,2,2570,11637,13495,393,31461
Sales,0,0,2,0,36191,41808,0,78001
All,16721,126984,24,107992,102623,118822,16737,489903

In [78]:
pd.crosstab(df.dept_name, df.title, normalize=True, margins=True).round(6) * 100

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader,All
dept_name,,,,,,,,
Customer Service,0.0608,0.4821,0.0008,0.4138,2.8424,3.2966,0.0631,7.1596
Development,1.5858,11.8666,0.0004,10.0685,0.2545,0.2907,1.5683,25.6349
Finance,0.0000,0.0000,0.0004,0.0000,2.4778,2.8432,0.0000,5.3215
Human Resources,0.0000,0.0000,0.0004,0.0000,2.5054,2.9275,0.0000,5.4333
Marketing,0.0000,0.0000,0.0004,0.0000,2.8455,3.3060,0.0000,6.1518
Production,1.3156,10.1345,0.0008,8.6150,0.2592,0.3017,1.3384,21.9652
Quality Management,0.3737,2.8275,0.0008,2.4217,0.0000,0.0000,0.3664,5.9902
Research,0.0772,0.6095,0.0004,0.5246,2.3754,2.7546,0.0802,6.4219
Sales,0.0000,0.0000,0.0004,0.0000,7.3874,8.5339,0.0000,15.9217
All,3.4131,25.9202,0.0049,22.0435,20.9476,24.2542,3.4164,100.0000

# Extra
crosstab for CURRENT titles and departments

In [84]:
query = '''
SELECT emp_no, title, dept_name 
FROM titles
	JOIN dept_emp
		USING (emp_no)
	JOIN departments
		USING (dept_no)
WHERE titles.to_date > now()
	AND dept_emp.to_date > now()
;'''

ext_df = pd.read_sql(query, connection)

In [85]:
ext_df.shape

(240124, 3)

In [87]:
pd.crosstab(ext_df.dept_name, ext_df.title, normalize=True, margins=True).round(6) * 100

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader,All
dept_name,,,,,,,,
Customer Service,0.0283,0.2611,0.0004,0.7454,4.6926,1.4884,0.1004,7.3166
Development,0.6880,5.8470,0.0004,16.1650,0.4518,0.1312,2.2809,25.5643
Finance,0.0000,0.0000,0.0004,0.0000,3.9750,1.2040,0.0000,5.1794
Human Resources,0.0000,0.0000,0.0004,0.0000,4.0912,1.2798,0.0000,5.3714
Marketing,0.0000,0.0000,0.0004,0.0000,4.7017,1.4788,0.0000,6.1810
Production,0.5839,5.0312,0.0004,14.0032,0.4677,0.1453,1.9669,22.1985
Quality Management,0.1620,1.4180,0.0004,3.9388,0.0000,0.0000,0.5385,6.0577
Research,0.0321,0.3457,0.0004,0.9370,3.7864,1.1952,0.1337,6.4304
Sales,0.0000,0.0000,0.0004,0.0000,11.9926,3.7077,0.0000,15.7006
All,1.4942,12.9029,0.0037,35.7894,34.1590,10.6303,5.0203,100.0000

What is the salary distribution for title and department among current employees?

In [79]:
query = '''
SELECT emp_no, title, dept_name, salary
FROM titles
	JOIN dept_emp
		USING (emp_no)
	JOIN departments
		USING (dept_no)
	JOIN salaries
		USING (emp_no)
WHERE titles.to_date > now()
	AND dept_emp.to_date > now()
    AND salaries.to_date > now()
;'''

extra_df = pd.read_sql(query, connection)

In [80]:
extra_df.head()

   emp_no         title         dept_name  salary
0   10038  Senior Staff  Customer Service   64254
1   10049  Senior Staff  Customer Service   51326
2   10060  Senior Staff  Customer Service   93188
3   10088  Senior Staff  Customer Service   98003
4   10112         Staff  Customer Service   61070

In [86]:
extra_df.shape

(240124, 4)

In [88]:
pd.pivot_table(data=extra_df, values='salary', index='dept_name', 
               columns='title', aggfunc='sum', margins=True)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader,All
dept_name,,,,,,,,
Customer Service,4013699.0,3.735998e+07,58745.0,1.274902e+08,7.919296e+08,2.051514e+08,16130639.0,1182134209
Development,95209078.0,8.389918e+08,74510.0,2.754763e+09,7.435305e+07,1.760167e+07,372256050.0,4153249050
Finance,NaN,NaN,83457.0,NaN,7.804749e+08,1.964916e+08,NaN,977049936
Human Resources,NaN,NaN,65400.0,NaN,6.589493e+08,1.654500e+08,NaN,824464664
Marketing,NaN,NaN,106491.0,NaN,9.406561e+08,2.474708e+08,NaN,1188233434
Production,80311082.0,7.249665e+08,56654.0,2.394396e+09,7.721616e+07,1.936144e+07,320011423.0,3616319369
Quality Management,21607713.0,1.952076e+08,72876.0,6.508429e+08,NaN,NaN,84188157.0,951919236
Research,4513882.0,5.014574e+07,79393.0,1.590033e+08,6.473888e+08,1.663136e+08,21205677.0,1048650423
Sales,NaN,NaN,101987.0,NaN,2.648902e+09,7.008421e+08,NaN,3349845802
All,205655454.0,1.846672e+09,699513.0,6.086495e+09,6.619870e+09,1.718683e+09,813791946.0,17291866123

In [94]:
pd.crosstab(values=extra_df['salary'], index=extra_df['dept_name'], 
            columns=extra_df['title'], aggfunc='sum', 
            margins=True, normalize=True).round(6) * 100

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader,All
dept_name,,,,,,,,
Customer Service,0.0232,0.2161,0.0003,0.7373,4.5798,1.1864,0.0933,6.8364
Development,0.5506,4.8519,0.0004,15.9310,0.4300,0.1018,2.1528,24.0185
Finance,0.0000,0.0000,0.0005,0.0000,4.5135,1.1363,0.0000,5.6503
Human Resources,0.0000,0.0000,0.0004,0.0000,3.8107,0.9568,0.0000,4.7679
Marketing,0.0000,0.0000,0.0006,0.0000,5.4399,1.4311,0.0000,6.8716
Production,0.4644,4.1925,0.0003,13.8470,0.4465,0.1120,1.8506,20.9134
Quality Management,0.1250,1.1289,0.0004,3.7639,0.0000,0.0000,0.4869,5.5050
Research,0.0261,0.2900,0.0005,0.9195,3.7439,0.9618,0.1226,6.0644
Sales,0.0000,0.0000,0.0006,0.0000,15.3188,4.0530,0.0000,19.3724
All,1.1893,10.6794,0.0040,35.1986,38.2831,9.9393,4.7062,100.0000